content/roam/20211217115351-mlops.org
:PROPERTIES:
:ID:       fed316c6-eeb4-4267-b8e2-448a3d789927
:END:
#+title: MLOps

* Terminology
MLOps
AIOps (AI for DevOps)
DataOps: continuous monitoring of data quality and metadata change; has intersection with MLOps
* Definition

standardization and streamlining of machine learning life cycle

define business goal --> access, understand and clean data --> build machine learning --> deploy machine learning --> iterate

business problem --> machine learning model
Goal: decision automation, company wide, parallel, risk control,

* Challenge

** dependencies: data changing, business shifting, results applying to business, real feedback, continuous evaluation, align with original goal
** multidiscipline: business, data science, IT, different tools and skills
** Data scientists not software engineers: model building and assessment
*** need Software engineer: deployment, operation
*** streched data scientists
** compares to DevOps: streamlineing SW changes and updates.
*** SAME:
**** robust automation and trust between teams
**** collaboration and communication
**** end2end service life cycle (build, test, release)
**** prioritizing continuous delivery and high quality
*** DIFFERENT:
**** Deploying no code but models to production
**** code is static, while data is changing and model is dynamic, learning and adapting to new inputs, ML = code + data
** Need to be at Enterprise Level at a large scale
*** multistage
*** mulit-discipline
*** mulit-phase
*** heterogeneous environment
*** framework
*** best practices
*   Benefit
** mitigate risk
*** risk assessment
**** being unavailable for a given period of time
**** bad prediction for a given sample
**** accuracy or fairness decrease over time
**** skill to maintain the model (data scientists)
*** risk mitigation
**** performance assessment can be done only in production: data dependent!
**** sensitive to production environment, opengsource sw, operating systems
**** pushing models into production is not the final step of machine learning life cycle
***** monitoring performance
***** model updating
*** responsible AI
**** intentionality: aligned with purpose, compliant and unbiased sources, collaborate approach to AI projects that ensures mulitple checkes and balance potential model bias, explanability,
**** accountablity: centrally controlling, managing and auditing enterprise AI effort, traceability
** scale up at enterprise level
*** MLOps discipline
**** Versioning (model, design), monitoring and tracking
**** Continuous benchmarking, promoting better models
* Deployment with MLOps
** essential practices
*** model quality and continuity
** risk without MLOps
*** business risk with model quality, conitnuity (biased model, poor prediction)
** transparency and accountability
*** management （MLOps and C-suite) should understand MLOps,
**** what ML models are deployed in production
**** their effect on business
**** drill down to understand data pipeline (from raw data to final output)
