20211217115351-mlops.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MLOps</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">MLOps</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd589ebf">Terminology</a></li>
<li><a href="#org4f124fb">Definition</a></li>
<li><a href="#orgf497245">Challenge</a>
<ul>
<li><a href="#org4d5f49f">dependencies: data changing, business shifting, results applying to business, real feedback, continuous evaluation, align with original goal</a></li>
<li><a href="#org829b076">multidiscipline: business, data science, IT, different tools and skills</a></li>
<li><a href="#org88a911b">Data scientists not software engineers: model building and assessment</a>
<ul>
<li><a href="#org9f286de">need Software engineer: deployment, operation</a></li>
<li><a href="#org89419a4">streched data scientists</a></li>
</ul>
</li>
<li><a href="#org0d77c42">compares to DevOps: streamlineing SW changes and updates.</a>
<ul>
<li><a href="#orgdcd93e5">SAME:</a></li>
<li><a href="#orgbca6d76">DIFFERENT:</a></li>
</ul>
</li>
<li><a href="#org42da9bd">Need to be at Enterprise Level at a large scale</a>
<ul>
<li><a href="#org19d9026">multistage</a></li>
<li><a href="#orgdd4ffd7">mulit-discipline</a></li>
<li><a href="#org1f676b8">mulit-phase</a></li>
<li><a href="#org8d4eefc">heterogeneous environment</a></li>
<li><a href="#org4ac3282">framework</a></li>
<li><a href="#orgda297a1">best practices</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge60cd18">Benefit</a>
<ul>
<li><a href="#org5b2bc1f">mitigate risk</a>
<ul>
<li><a href="#orgd5299f5">risk assessment</a></li>
<li><a href="#org7049c4a">risk mitigation</a></li>
<li><a href="#orga6cde35">responsible AI</a></li>
</ul>
</li>
<li><a href="#orgf2f44b6">scale up at enterprise level</a>
<ul>
<li><a href="#org555f345">MLOps discipline</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org32a9319">Deployment with MLOps</a>
<ul>
<li><a href="#org154a5d5">essential practices</a>
<ul>
<li><a href="#org165a314">model quality and continuity</a></li>
</ul>
</li>
<li><a href="#org0ac5f69">risk without MLOps</a>
<ul>
<li><a href="#orgeef8597">business risk with model quality, conitnuity (biased model, poor prediction)</a></li>
</ul>
</li>
<li><a href="#org4ffdb55">transparency and accountability</a>
<ul>
<li><a href="#orgdb5386d">management （MLOps and C-suite) should understand MLOps,</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org795e2b3">People of MLOps</a>
<ul>
<li><a href="#org077097f">subject matter experts SME</a>
<ul>
<li><a href="#org5567ab2">Business Decision Modeling / Enterprise Decision Management</a></li>
<li><a href="#org9d74229">active at the beginning and end of ML model</a></li>
<li><a href="#orgbe9f6dc">close the feedback loop not to ignore important information</a></li>
<li><a href="#orge5690a8">easy to understand model performancein business terms, unexpected performance shifts</a></li>
<li><a href="#org29d2239">flag results that don't align with business expectations</a></li>
<li><a href="#org968a940">need transparency and understand data pipelines, communication with data scientists for models</a></li>
<li><a href="#orgba95ac1">responsible AI</a></li>
</ul>
</li>
<li><a href="#orgd07a26c">data scientists</a>
<ul>
<li><a href="#org34c4f89">most criticalchallenged by siloed data, process and tools, difficult to efforts</a></li>
<li><a href="#org751e1cb">benefit from MLOps</a></li>
<li><a href="#org15a9d9a">build model</a></li>
<li><a href="#orgf3e2814">understand SME requirements, help to frame business problems for a viable ML solution (difficult!, BDM helps)</a></li>
<li><a href="#org4d611d6">siloed from core of the business and SME, orgnizational infrastructure</a></li>
<li><a href="#orgcf0a9de">interface to data engineers</a></li>
<li><a href="#orgd476178">assess model quality to ensure it's working in production,</a></li>
<li><a href="#orgc9f0fc4">answer initial business questions or needs,</a></li>
<li><a href="#orga1310bb">operationalization: pushing model to production and measuring the performance against business goals, while MLOps maintains the models and data pipeline in production, new Operationalization.</a></li>
<li><a href="#org3033710">transparency: drill down to data pipelines, quick assessment and adjustments.</a></li>
<li><a href="#orgd05655a">Automated model packaging and delivery for quick and easy (safe) deployment to production.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb3ad594">Framework</a>
<ul>
<li><a href="#org6364899">metaflow</a></li>
<li><a href="#org03fd2f7">kubeflow</a></li>
<li><a href="#org59e0b43">baiduflow</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       fed316c6-eeb4-4267-b8e2-448a3d789927
</p>

<div id="outline-container-orgd589ebf" class="outline-2">
<h2 id="orgd589ebf">Terminology</h2>
<div class="outline-text-2" id="text-orgd589ebf">
<p>
MLOps
AIOps (AI for DevOps)
DataOps: continuous monitoring of data quality and metadata change; has intersection with MLOps
</p>
</div>
</div>
<div id="outline-container-org4f124fb" class="outline-2">
<h2 id="org4f124fb">Definition</h2>
<div class="outline-text-2" id="text-org4f124fb">
<p>
standardization and streamlining of machine learning life cycle
</p>

<p>
define business goal &#x2013;&gt; access, understand and clean data &#x2013;&gt; build machine learning &#x2013;&gt; deploy machine learning &#x2013;&gt; iterate
</p>

<p>
business problem &#x2013;&gt; machine learning model
Goal: decision automation, company wide, parallel, risk control,
</p>
</div>
</div>

<div id="outline-container-orgf497245" class="outline-2">
<h2 id="orgf497245">Challenge</h2>
<div class="outline-text-2" id="text-orgf497245">
</div>
<div id="outline-container-org4d5f49f" class="outline-3">
<h3 id="org4d5f49f">dependencies: data changing, business shifting, results applying to business, real feedback, continuous evaluation, align with original goal</h3>
</div>
<div id="outline-container-org829b076" class="outline-3">
<h3 id="org829b076">multidiscipline: business, data science, IT, different tools and skills</h3>
</div>
<div id="outline-container-org88a911b" class="outline-3">
<h3 id="org88a911b">Data scientists not software engineers: model building and assessment</h3>
<div class="outline-text-3" id="text-org88a911b">
</div>
<div id="outline-container-org9f286de" class="outline-4">
<h4 id="org9f286de">need Software engineer: deployment, operation</h4>
</div>
<div id="outline-container-org89419a4" class="outline-4">
<h4 id="org89419a4">streched data scientists</h4>
</div>
</div>
<div id="outline-container-org0d77c42" class="outline-3">
<h3 id="org0d77c42">compares to DevOps: streamlineing SW changes and updates.</h3>
<div class="outline-text-3" id="text-org0d77c42">
</div>
<div id="outline-container-orgdcd93e5" class="outline-4">
<h4 id="orgdcd93e5">SAME:</h4>
<div class="outline-text-4" id="text-orgdcd93e5">
</div>
<ul class="org-ul">
<li><a id="org8c12dd9"></a>robust automation and trust between teams<br /></li>
<li><a id="orgf22d224"></a>collaboration and communication<br /></li>
<li><a id="org3a44d38"></a>end2end service life cycle (build, test, release)<br /></li>
<li><a id="orgbc0350b"></a>prioritizing continuous delivery and high quality<br /></li>
</ul>
</div>
<div id="outline-container-orgbca6d76" class="outline-4">
<h4 id="orgbca6d76">DIFFERENT:</h4>
<div class="outline-text-4" id="text-orgbca6d76">
</div>
<ul class="org-ul">
<li><a id="org1cd3290"></a>Deploying no code but models to production<br /></li>
<li><a id="orgcdc7ddd"></a>code is static, while data is changing and model is dynamic, learning and adapting to new inputs, ML = code + data<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org42da9bd" class="outline-3">
<h3 id="org42da9bd">Need to be at Enterprise Level at a large scale</h3>
<div class="outline-text-3" id="text-org42da9bd">
</div>
<div id="outline-container-org19d9026" class="outline-4">
<h4 id="org19d9026">multistage</h4>
</div>
<div id="outline-container-orgdd4ffd7" class="outline-4">
<h4 id="orgdd4ffd7">mulit-discipline</h4>
</div>
<div id="outline-container-org1f676b8" class="outline-4">
<h4 id="org1f676b8">mulit-phase</h4>
</div>
<div id="outline-container-org8d4eefc" class="outline-4">
<h4 id="org8d4eefc">heterogeneous environment</h4>
</div>
<div id="outline-container-org4ac3282" class="outline-4">
<h4 id="org4ac3282">framework</h4>
</div>
<div id="outline-container-orgda297a1" class="outline-4">
<h4 id="orgda297a1">best practices</h4>
</div>
</div>
</div>
<div id="outline-container-orge60cd18" class="outline-2">
<h2 id="orge60cd18">Benefit</h2>
<div class="outline-text-2" id="text-orge60cd18">
</div>
<div id="outline-container-org5b2bc1f" class="outline-3">
<h3 id="org5b2bc1f">mitigate risk</h3>
<div class="outline-text-3" id="text-org5b2bc1f">
</div>
<div id="outline-container-orgd5299f5" class="outline-4">
<h4 id="orgd5299f5">risk assessment</h4>
<div class="outline-text-4" id="text-orgd5299f5">
</div>
<ul class="org-ul">
<li><a id="orgbb0e737"></a>being unavailable for a given period of time<br /></li>
<li><a id="org2397205"></a>bad prediction for a given sample<br /></li>
<li><a id="org162eee1"></a>accuracy or fairness decrease over time<br /></li>
<li><a id="org312cfde"></a>skill to maintain the model (data scientists)<br /></li>
</ul>
</div>
<div id="outline-container-org7049c4a" class="outline-4">
<h4 id="org7049c4a">risk mitigation</h4>
<div class="outline-text-4" id="text-org7049c4a">
</div>
<ul class="org-ul">
<li><a id="org08b42fb"></a>performance assessment can be done only in production: data dependent!<br /></li>
<li><a id="org07bd541"></a>sensitive to production environment, opengsource sw, operating systems<br /></li>
<li><a id="orgb94eb89"></a>pushing models into production is not the final step of machine learning life cycle<br />
<ul class="org-ul">
<li><a id="orgc84abb8"></a>monitoring performance<br /></li>
<li><a id="org77b046e"></a>model updating<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orga6cde35" class="outline-4">
<h4 id="orga6cde35">responsible AI</h4>
<div class="outline-text-4" id="text-orga6cde35">
</div>
<ul class="org-ul">
<li><a id="orgc5ce50b"></a>intentionality: aligned with purpose, compliant and unbiased sources, collaborate approach to AI projects that ensures mulitple checkes and balance potential model bias, explanability,<br /></li>
<li><a id="org198f38c"></a>accountablity: centrally controlling, managing and auditing enterprise AI effort, traceability<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgf2f44b6" class="outline-3">
<h3 id="orgf2f44b6">scale up at enterprise level</h3>
<div class="outline-text-3" id="text-orgf2f44b6">
</div>
<div id="outline-container-org555f345" class="outline-4">
<h4 id="org555f345">MLOps discipline</h4>
<div class="outline-text-4" id="text-org555f345">
</div>
<ul class="org-ul">
<li><a id="org5d0308f"></a>Versioning (model, design), monitoring and tracking<br /></li>
<li><a id="org020913d"></a>Continuous benchmarking, promoting better models<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org32a9319" class="outline-2">
<h2 id="org32a9319">Deployment with MLOps</h2>
<div class="outline-text-2" id="text-org32a9319">
</div>
<div id="outline-container-org154a5d5" class="outline-3">
<h3 id="org154a5d5">essential practices</h3>
<div class="outline-text-3" id="text-org154a5d5">
</div>
<div id="outline-container-org165a314" class="outline-4">
<h4 id="org165a314">model quality and continuity</h4>
</div>
</div>
<div id="outline-container-org0ac5f69" class="outline-3">
<h3 id="org0ac5f69">risk without MLOps</h3>
<div class="outline-text-3" id="text-org0ac5f69">
</div>
<div id="outline-container-orgeef8597" class="outline-4">
<h4 id="orgeef8597">business risk with model quality, conitnuity (biased model, poor prediction)</h4>
</div>
</div>
<div id="outline-container-org4ffdb55" class="outline-3">
<h3 id="org4ffdb55">transparency and accountability</h3>
<div class="outline-text-3" id="text-org4ffdb55">
</div>
<div id="outline-container-orgdb5386d" class="outline-4">
<h4 id="orgdb5386d">management （MLOps and C-suite) should understand MLOps,</h4>
<div class="outline-text-4" id="text-orgdb5386d">
</div>
<ul class="org-ul">
<li><a id="org2e031d6"></a>what ML models are deployed in production<br /></li>
<li><a id="orgbe03a21"></a>their effect on business<br /></li>
<li><a id="org450d687"></a>drill down to understand data pipeline (from raw data to final output)<br /></li>
</ul>
</div>
</div>
</div>
