content/roam/20211217115351-mlops.org
* People of MLOps


| Name                         | Requirements                                                                                                                                      | Role                                                                                                                                       |
|------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------|
| domain expert                | esay to understand model performance in business terms                                                                                            | provide business questions, goals, KPIs for ML models                                                                                      |
| ----                         | mechanism or feedback loop for monitoring model performance                                                                                       | continually evaluate and ensure that model performance aligns with or resolves the initial need                                            |
| data scientists              | build models that address the business question or needs brought by subject matter experts                                                        | automated model packaging and delivery for quick and easy (yet safe) deployment to production                                              |
| ----                         | deliver operationalizable models so that they can be properly used in the production environment and with production data.                        | ability to develop tests to determine the quality of deployed models and to make continual improvments.                                    |
| ----                         | assess model quality (of both original and tests) in tandem with subject matter expoerts to ensure they answer initial business questions or need | visibility into the performance of all deployed models (including side-by-side for tests) from on central location                         |
| ----                         | ----                                                                                                                                              | ability to investigate data pipelines of each model to make quick assessments and adjustments regardless of who originally built the model |
| data engineers               | optimize the retrieval and use of data to power ML models                                                                                         | visibility into performance of all deployed models                                                                                         |
| ----                         | ----                                                                                                                                              | ability to see the full details of individual data pipelines to address underlying data plumbing issues                                    |
| Software engineers           | Integrate ML models in the company's applications and systems.                                                                                    | versioniing and automatic tests                                                                                                            |
| ----                         | ensure that ML models work seamliessly with other non-machine-learning-based applications                                                         | the ability to work in parallel on the same application.                                                                                   |
| DevOps                       | conduct and build operational systems and test for security, performance, availability.                                                           | seamless integration of MLOps into the larger DevOps strategy of the enterprise.                                                           |
| ----                         | continuous integration/continuous delivery (CI/CD) pipeline management                                                                            | seamliess deployment pipeline                                                                                                              |
| model risk managers/auditors | minimize overall risk to the company as a result of ML models in production                                                                       | robust, likely automated, reporting tools on all models (currently or ever in production),                                                 |
| ----                         | ensure compliance with internal and external requirements before pushing ML models to production.                                                 | ----                                                                                                                                       |
| Machine learning architects  | ensure a scalable and flexible environment for ML model pipelines, from design to development and monitoring.                                     | high-level overview of models and their resources consumed.                                                                                |
| ----                         | introduce new technologies when appropriate that improve ML model performance in production.                                                      | ability to drill down into data pipelines to assess and adjust infrastructure needs.                                                       |

** subject matter experts SME
*** Business Decision Modeling / Enterprise Decision Management
**** information based decision
**** decision context and potential impact of model changes
**** structure and describe their needs
*** active at the beginning and end of ML model
*** close the feedback loop not to ignore important information
*** easy to understand model performancein business terms, unexpected performance shifts
*** flag results that don't align with business expectations
*** need transparency and understand data pipelines, communication with data scientists for models
*** responsible AI
** data scientists
*** most criticalchallenged by siloed data, process and tools, difficult to efforts
*** benefit from MLOps
*** build model
*** understand SME requirements, help to frame business problems for a viable ML solution (difficult!, BDM helps)
*** siloed from core of the business and SME, orgnizational infrastructure
*** interface to data engineers
*** assess model quality to ensure it's working in production,
*** answer initial business questions or needs,
*** operationalization: pushing model to production and measuring the performance against business goals, while MLOps maintains the models and data pipeline in production, new Operationalization.
