20211217115351-mlops.html
<div id="outline-container-org795e2b3" class="outline-2">
<h2 id="org795e2b3">People of MLOps</h2>
<div class="outline-text-2" id="text-org795e2b3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Requirements</th>
<th scope="col" class="org-left">Role</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">domain expert</td>
<td class="org-left">esay to understand model performance in business terms</td>
<td class="org-left">provide business questions, goals, KPIs for ML models</td>
</tr>

<tr>
<td class="org-left">----</td>
<td class="org-left">mechanism or feedback loop for monitoring model performance</td>
<td class="org-left">continually evaluate and ensure that model performance aligns with or resolves the initial need</td>
</tr>

<tr>
<td class="org-left">data scientists</td>
<td class="org-left">build models that address the business question or needs brought by subject matter experts</td>
<td class="org-left">automated model packaging and delivery for quick and easy (yet safe) deployment to production</td>
</tr>

<tr>
<td class="org-left">----</td>
<td class="org-left">deliver operationalizable models so that they can be properly used in the production environment and with production data.</td>
<td class="org-left">ability to develop tests to determine the quality of deployed models and to make continual improvments.</td>
</tr>

<tr>
<td class="org-left">----</td>
<td class="org-left">assess model quality (of both original and tests) in tandem with subject matter expoerts to ensure they answer initial business questions or need</td>
<td class="org-left">visibility into the performance of all deployed models (including side-by-side for tests) from on central location</td>
</tr>

<tr>
<td class="org-left">----</td>
<td class="org-left">----</td>
<td class="org-left">ability to investigate data pipelines of each model to make quick assessments and adjustments regardless of who originally built the model</td>
</tr>

<tr>
<td class="org-left">data engineers</td>
<td class="org-left">optimize the retrieval and use of data to power ML models</td>
<td class="org-left">visibility into performance of all deployed models</td>
</tr>

<tr>
<td class="org-left">----</td>
<td class="org-left">----</td>
<td class="org-left">ability to see the full details of individual data pipelines to address underlying data plumbing issues</td>
</tr>

<tr>
<td class="org-left">Software engineers</td>
<td class="org-left">Integrate ML models in the company's applications and systems.</td>
<td class="org-left">versioniing and automatic tests</td>
</tr>

<tr>
<td class="org-left">----</td>
<td class="org-left">ensure that ML models work seamliessly with other non-machine-learning-based applications</td>
<td class="org-left">the ability to work in parallel on the same application.</td>
</tr>

<tr>
<td class="org-left">DevOps</td>
<td class="org-left">conduct and build operational systems and test for security, performance, availability.</td>
<td class="org-left">seamless integration of MLOps into the larger DevOps strategy of the enterprise.</td>
</tr>

<tr>
<td class="org-left">----</td>
<td class="org-left">continuous integration/continuous delivery (CI/CD) pipeline management</td>
<td class="org-left">seamliess deployment pipeline</td>
</tr>

<tr>
<td class="org-left">model risk managers/auditors</td>
<td class="org-left">minimize overall risk to the company as a result of ML models in production</td>
<td class="org-left">robust, likely automated, reporting tools on all models (currently or ever in production),</td>
</tr>

<tr>
<td class="org-left">----</td>
<td class="org-left">ensure compliance with internal and external requirements before pushing ML models to production.</td>
<td class="org-left">----</td>
</tr>

<tr>
<td class="org-left">Machine learning architects</td>
<td class="org-left">ensure a scalable and flexible environment for ML model pipelines, from design to development and monitoring.</td>
<td class="org-left">high-level overview of models and their resources consumed.</td>
</tr>

<tr>
<td class="org-left">----</td>
<td class="org-left">introduce new technologies when appropriate that improve ML model performance in production.</td>
<td class="org-left">ability to drill down into data pipelines to assess and adjust infrastructure needs.</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org077097f" class="outline-3">
<h3 id="org077097f">subject matter experts SME</h3>
<div class="outline-text-3" id="text-org077097f">
</div>
<div id="outline-container-org5567ab2" class="outline-4">
<h4 id="org5567ab2">Business Decision Modeling / Enterprise Decision Management</h4>
<div class="outline-text-4" id="text-org5567ab2">
</div>
<ul class="org-ul">
<li><a id="orgb664430"></a>information based decision<br /></li>
<li><a id="orgab26c30"></a>decision context and potential impact of model changes<br /></li>
<li><a id="org2132e1d"></a>structure and describe their needs<br /></li>
</ul>
</div>
<div id="outline-container-org9d74229" class="outline-4">
<h4 id="org9d74229">active at the beginning and end of ML model</h4>
</div>
<div id="outline-container-orgbe9f6dc" class="outline-4">
<h4 id="orgbe9f6dc">close the feedback loop not to ignore important information</h4>
</div>
<div id="outline-container-orge5690a8" class="outline-4">
<h4 id="orge5690a8">easy to understand model performancein business terms, unexpected performance shifts</h4>
</div>
<div id="outline-container-org29d2239" class="outline-4">
<h4 id="org29d2239">flag results that don't align with business expectations</h4>
</div>
<div id="outline-container-org968a940" class="outline-4">
<h4 id="org968a940">need transparency and understand data pipelines, communication with data scientists for models</h4>
</div>
<div id="outline-container-orgba95ac1" class="outline-4">
<h4 id="orgba95ac1">responsible AI</h4>
</div>
</div>
<div id="outline-container-orgd07a26c" class="outline-3">
<h3 id="orgd07a26c">data scientists</h3>
<div class="outline-text-3" id="text-orgd07a26c">
</div>
<div id="outline-container-org34c4f89" class="outline-4">
<h4 id="org34c4f89">most criticalchallenged by siloed data, process and tools, difficult to efforts</h4>
</div>
<div id="outline-container-org751e1cb" class="outline-4">
<h4 id="org751e1cb">benefit from MLOps</h4>
</div>
<div id="outline-container-org15a9d9a" class="outline-4">
<h4 id="org15a9d9a">build model</h4>
</div>
<div id="outline-container-orgf3e2814" class="outline-4">
<h4 id="orgf3e2814">understand SME requirements, help to frame business problems for a viable ML solution (difficult!, BDM helps)</h4>
</div>
<div id="outline-container-org4d611d6" class="outline-4">
<h4 id="org4d611d6">siloed from core of the business and SME, orgnizational infrastructure</h4>
</div>
<div id="outline-container-orgcf0a9de" class="outline-4">
<h4 id="orgcf0a9de">interface to data engineers</h4>
</div>
<div id="outline-container-orgd476178" class="outline-4">
<h4 id="orgd476178">assess model quality to ensure it's working in production,</h4>
</div>
<div id="outline-container-orgc9f0fc4" class="outline-4">
<h4 id="orgc9f0fc4">answer initial business questions or needs,</h4>
</div>
<div id="outline-container-orga1310bb" class="outline-4">
<h4 id="orga1310bb">operationalization: pushing model to production and measuring the performance against business goals, while MLOps maintains the models and data pipeline in production, new Operationalization.</h4>
</div>
