content/roam/20211217115351-mlops.org
*** transparency: drill down to data pipelines, quick assessment and adjustments.
*** Automated model packaging and delivery for quick and easy (safe) deployment to production.

* Framework
** [[./20220411120227-metaflow.org][metaflow]]
** [[./20220622084010-kubeflow.org][kubeflow]]
** [[./20220622100017-baiduflow.org][baiduflow]]
