20211217115351-mlops.html
<div id="outline-container-org3033710" class="outline-4">
<h4 id="org3033710">transparency: drill down to data pipelines, quick assessment and adjustments.</h4>
</div>
<div id="outline-container-orgd05655a" class="outline-4">
<h4 id="orgd05655a">Automated model packaging and delivery for quick and easy (safe) deployment to production.</h4>
</div>
</div>
</div>

<div id="outline-container-orgb3ad594" class="outline-2">
<h2 id="orgb3ad594">Framework</h2>
<div class="outline-text-2" id="text-orgb3ad594">
</div>
<div id="outline-container-org6364899" class="outline-3">
<h3 id="org6364899"><a href="./20220411120227-metaflow.html">metaflow</a></h3>
</div>
<div id="outline-container-org03fd2f7" class="outline-3">
<h3 id="org03fd2f7"><a href="./20220622084010-kubeflow.html">kubeflow</a></h3>
</div>
<div id="outline-container-org59e0b43" class="outline-3">
<h3 id="org59e0b43"><a href="./20220622100017-baiduflow.html">baiduflow</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
